In [1]:
#Pandas Basic Assignment

In [10]:
import pandas as pd
import numpy as np

<font color="red">Question1: </font>Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series?

In [7]:
data=[4,8,15,16,23,42]
s=pd.Series(data)
print(s)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

<font color="red">Question2: </font>Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [13]:
data1=np.random.randint(1,100,10)

In [16]:
s2=pd.Series(data1)
print(s2)

0    46
1    68
2    91
3     5
4    62
5    39
6    47
7    84
8    48
9    19
dtype: int32

<font color="red">Question3: </font>Create a Pandas DataFrame that contains the following data:

In [20]:
columns=['Name','Age','Gender']
name=['Alice','Bob','Claire']
Age=[25,30,27]
Gender=['Female','Male','Female']

In [23]:
df1=pd.DataFrame(data={'Name':name,'Age':Age,'Gender':Gender})
df1

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

<font color="red">Question4: </font>What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

DataFrame is a two dimenssional labeled data structure. Similar to a table or spreadsheet. it is extremly powerful for handling strutured data.<br>
pandas.Series is an one dimenssional labeled array while DataFrame is two dimessional labeled data structure.

example:- Series

In [27]:
pd.Series([10,20,30,40,50,60])

0    10
1    20
2    30
3    40
4    50
5    60
dtype: int64

In [28]:
pd.DataFrame([["Alice",25,'Female'],['Bob',30,'Male'],['Claire',27,'Female']],columns=['Name','Age','Gender'])

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

<font color="red">Question5: </font>What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

Pandas provide wide range of function too manipulate data that are:-<br>
1.filter() <br>
2.query()<br>
3.sort_values()<br>
4.merge()<br>
5.groupby()<br>
7.drop()<br>
8.apply()<br>
9.replace()<br>

In [31]:
df2=pd.DataFrame([["Alice",25,'Female'],['Bob',30,'Male'],['Claire',27,'Female']],columns=['Name','Age','Gender'])
df2

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [39]:
#1.Filter()
df2[df2['Age']>25]

     Name  Age  Gender
1     Bob   30    Male
2  Claire   27  Female

In [40]:
#2.query()
df2.query('Age>27')

  Name  Age Gender
1  Bob   30   Male

In [41]:
#3.sort_values
df2.sort_values('Age')

     Name  Age  Gender
0   Alice   25  Female
2  Claire   27  Female
1     Bob   30    Male

<font color="red">Question6: </font>Which of the following is mutable in nature Series, DataFrame, Panel?

The Series and DataFrame are mutable in nature while the Panel is not mutable.

<font color="red">Question7: </font>Create a DataFrame using multiple Series. Explain with an example.

In [49]:
Name=pd.Series(['Kiran','Rahul','Rohit'])
Age=pd.Series([25,32,20])
Gender=pd.Series(['F','M','M'])

In [50]:
df3=pd.DataFrame({'Name':Name,'Age':Age,'Gender':Gender})
df3

    Name  Age Gender
0  Kiran   25      F
1  Rahul   32      M
2  Rohit   20      M

Here, I have created Name,Age and Gender as a Series and then I created DataFrame with the help of dictionary where I combine several Series objects as columns.